app/Controllers/CutiSpvController.php

SELECT `detail_status_cuti`.*, `users`.`nama`
FROM `detail_status_cuti`
LEFT JOIN `users` ON `users`.`id` = `detail_status_cuti`.`approved_by`
WHERE `pengajuan_id` = '6'
---
    public function detail($id)
    {
        $data['cuti'] = $this->pengajuanModel->find($id);

        $data['tracking'] = $this->detailModel
            ->select('detail_status_cuti.*, users.nama')
            ->join('users', 'users.id = detail_status_cuti.approved_by', 'left')
            ->where('pengajuan_id', $id)
            ->findAll();